---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupEditModeNoDuplicates
source: html/7248fbb0-7810-8dd6-4789-1b27e1bb630a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupEditModeNoDuplicates Property

Can't create duplicates in Edit Group mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupEditModeNoDuplicates { get; }
```